Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/atdf/ATSAMG51N18.atdf
        <module name="GPBR" id="6378" version="G">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="MATRIX" id="11049" version="E">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="MEM2MEM" id="11211" version="B">
          <instance name="MEM2MEM">
            <register-group address-space="base" name="MEM2MEM" name-in-module="MEM2MEM" offset="0x40028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11004" version="R">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="11116" version="T">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="6056" version="S">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="6088" version="ZE">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA9" function="B" group="NPCS" index="1"/>
              <signal pad="PB2" function="B" group="NPCS" index="1"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="21"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="11228" version="F">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="6082" version="ZB">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA2" function="A" group="TCLK" index="0"/>
              <signal pad="PA19" function="A" group="TCLK" index="1"/>
              <signal pad="PA20" function="A" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA23" function="B" group="TIOA" index="1"/>
              <signal pad="PA21" function="A" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA22" function="A" group="TIOB" index="2"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="23"/>
              <param name="INSTANCE_ID_CHANNEL1" value="24"/>
              <param name="INSTANCE_ID_CHANNEL2" value="25"/>
            </parameters>
          </instance>
        </module>
        <module name="TWI" id="6212" version="Z">
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB9" function="A" group="TWCK" index="1"/>
              <signal pad="PB11" function="A" group="TWCK" index="1"/>
              <signal pad="PB8" function="A" group="TWD" index="1"/>
              <signal pad="PB10" function="A" group="TWD" index="1"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="20"/>
            </parameters>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40040000"/>
            <signals>
              <signal pad="PB1" function="B" group="TWCK" index="2"/>
              <signal pad="PB11" function="B" group="TWCK" index="2"/>
              <signal pad="PB0" function="B" group="TWD" index="2"/>
              <signal pad="PB10" function="B" group="TWD" index="2"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="22"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIHS" id="11210" version="P">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWIHS" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="19"/>
            </parameters>
          </instance>
        </module>
