Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/atdf/ATSAMG51N18.atdf
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="Main Crystal Oscillator Bypass" mask="0x00000002" name="MOSCXTBY"/>
          <bitfield caption="Wait Mode Command (Write-only)" mask="0x00000004" name="WAITMODE"/>
          <bitfield caption="Main On-Chip RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main On-Chip RC Oscillator Frequency Selection" mask="0x00000070" name="MOSCRCF" values="CKGR_MOR__MOSCRCF"/>
          <bitfield caption="Main Crystal Oscillator Start-up Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Write Access Password" mask="0x00FF0000" name="KEY" values="CKGR_MOR__KEY"/>
          <bitfield caption="Main Oscillator Selection" mask="0x01000000" name="MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
        </register>
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Frequency Measure Ready" mask="0x00010000" name="MAINFRDY"/>
          <bitfield caption="RC Oscillator Frequency Measure (write-only)" mask="0x00100000" name="RCMEAS"/>
        </register>
        <register caption="PLLA Register" name="CKGR_PLLAR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="PLLA Control" mask="0x000000FF" name="PLLAEN"/>
          <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
          <bitfield caption="PLLA Multiplier" mask="0x0FFF0000" name="MULA"/>
          <bitfield mask="0x20000000" name="ZERO"/>
        </register>
        <register caption="Master Clock Register" name="PMC_MCKR" offset="0x0030" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000003" name="CSS" values="PMC_MCKR__CSS"/>
          <bitfield caption="Processor Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_MCKR__PRES"/>
          <bitfield caption="PLLA Divisor by 2" mask="0x00001000" name="PLLADIV2"/>
        </register>
        <register caption="Programmable Clock 0 Register 0" name="PMC_PCK" offset="0x40" rw="RW" size="4" count="3">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4" atomic-op="set:PMC_IMR">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4" atomic-op="clear:PMC_IMR">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
        </register>
