Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.1.21/samg51/atdf/ATSAMG51N18.atdf
        <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
          <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
          <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
        </register>
        <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
          <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
        </register>
        <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
          <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
          <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
          <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
        </register>
        <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
          <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
          <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
          <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
          <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
          <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
          <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
          <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
          <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="LQFP100">
      <pin position="11" pad="PA0"/>
      <pin position="12" pad="PA1"/>
      <pin position="90" pad="PA2"/>
      <pin position="10" pad="PA3"/>
      <pin position="9" pad="PA4"/>
      <pin position="13" pad="PA5"/>
      <pin position="28" pad="PA6"/>
      <pin position="18" pad="PA7"/>
      <pin position="19" pad="PA8"/>
      <pin position="79" pad="PA9"/>
      <pin position="72" pad="PA10"/>
      <pin position="65" pad="PA11"/>
      <pin position="64" pad="PA12"/>
      <pin position="63" pad="PA13"/>
      <pin position="62" pad="PA14"/>
      <pin position="31" pad="PA15"/>
      <pin position="30" pad="PA16"/>
      <pin position="53" pad="PA17"/>
      <pin position="54" pad="PA18"/>
      <pin position="55" pad="PA19"/>
      <pin position="56" pad="PA20"/>
      <pin position="36" pad="PA21"/>
      <pin position="35" pad="PA22"/>
      <pin position="32" pad="PA23"/>
      <pin position="86" pad="PA24"/>
      <pin position="57" pad="PB0"/>
      <pin position="58" pad="PB1"/>
      <pin position="59" pad="PB2"/>
      <pin position="60" pad="PB3"/>
      <pin position="80" pad="PB5"/>
      <pin position="84" pad="PB6"/>
      <pin position="91" pad="PB4"/>
      <pin position="85" pad="PB7"/>
      <pin position="87" pad="PB8"/>
      <pin position="88" pad="PB9"/>
      <pin position="68" pad="PB10"/>
      <pin position="69" pad="PB11"/>
      <pin position="8" pad="PB12"/>
      <pin position="1" pad="NC"/>
      <pin position="2" pad="NC"/>
      <pin position="3" pad="NC"/>
      <pin position="4" pad="NC"/>
      <pin position="5" pad="VDDIO"/>
      <pin position="6" pad="VDDIO"/>
      <pin position="7" pad="NRST"/>
      <pin position="14" pad="VDDIO"/>
      <pin position="15" pad="VDDCORE"/>
      <pin position="16" pad="VDDCORE"/>
      <pin position="17" pad="TEST"/>
      <pin position="20" pad="GND"/>
      <pin position="21" pad="NC"/>
      <pin position="22" pad="NC"/>
      <pin position="23" pad="NC"/>
      <pin position="24" pad="NC"/>
      <pin position="25" pad="NC"/>
      <pin position="26" pad="NC"/>
      <pin position="27" pad="NC"/>
      <pin position="29" pad="VDDIO"/>
      <pin position="33" pad="NC"/>
      <pin position="34" pad="NC"/>
      <pin position="37" pad="VDDIO"/>
      <pin position="38" pad="VDDIO"/>
      <pin position="39" pad="GND"/>
      <pin position="40" pad="GND"/>
      <pin position="41" pad="GND"/>
      <pin position="42" pad="GND"/>
      <pin position="43" pad="GND"/>
      <pin position="44" pad="VDDOUT"/>
      <pin position="45" pad="VDDOUT"/>
      <pin position="46" pad="VDDIO"/>
      <pin position="47" pad="VDDIO"/>
      <pin position="48" pad="VDDIO"/>
      <pin position="49" pad="NC"/>
      <pin position="50" pad="NC"/>
      <pin position="51" pad="NC"/>
      <pin position="52" pad="NC"/>
      <pin position="61" pad="VDDIO"/>
      <pin position="66" pad="VDDCORE"/>
      <pin position="67" pad="VDDCORE"/>
      <pin position="70" pad="GND"/>
      <pin position="71" pad="GND"/>
      <pin position="73" pad="NC"/>
      <pin position="74" pad="NC"/>
      <pin position="75" pad="NC"/>
      <pin position="76" pad="NC"/>
      <pin position="77" pad="NC"/>
      <pin position="78" pad="NC"/>
      <pin position="81" pad="GND"/>
      <pin position="82" pad="GND"/>
      <pin position="83" pad="GND"/>
      <pin position="89" pad="VDDIO"/>
      <pin position="92" pad="NC"/>
      <pin position="93" pad="JTAGSEL"/>
      <pin position="94" pad="VDDIO"/>
      <pin position="95" pad="VDDIO"/>
      <pin position="96" pad="NC"/>
      <pin position="97" pad="NC"/>
      <pin position="98" pad="NC"/>
      <pin position="99" pad="NC"/>
      <pin position="100" pad="NC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
